#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b6d2a767-0a8e-48fd-9af8-8c3e7af499af]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=69f112e8-3c0a-4130-b4cf-b0c99a01ba79]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5ca5a527-eb46-4a87-8c2e-dec2a1ce581d]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=32a65459-8143-4452-b2b9-20c09b3970f3]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=829ea884-556d-44dc-baaf-b3e019db8362]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfecb841-fc5a-4ada-95ee-7862304ed89a]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=863169a6-2a0b-4bf7-852c-1b6cbc602b85]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6ecffbc4-907e-4719-a080-6d13bfebd1a1]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79bf113d-a17f-4129-97c5-75d5ca0bc3a1]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a12e33b4-b32a-4620-9c05-0c9e82bfb029]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3204f3bb-b97f-4cf0-bd34-981b16e82061]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e12c7cba-c159-4ff6-a1a5-7f9c51cc92b8]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=518d2b72-db37-4eec-988d-b152e0d0d7a6]
module.keycloak_prod.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=86645255-9d6d-4c41-8afa-7e86a9466ef9]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f85d2179-5d76-4bf2-b8a2-03765cc19d75]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ae948df4-2932-4bb8-83a5-fc9f84e47e9f]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e935485-4cf1-460f-b611-fa0147701fe9]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f70b3b01-c291-4174-ba58-3144211642e1]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f19962a8-7572-4ce9-ad28-0a3643588c53]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=427186bb-b6f7-48e8-ba04-6a46b120a7d6]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c9d0930c-f6ce-47f8-9a40-1d45f77b9c89]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=08454973-aece-41fd-bd2b-4eeaa42191a7]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7be05a4d-094f-469a-ac5c-49337733d4af]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1eb19d9-89b2-4fc0-ae40-6d012c908837]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9e66abb4-b63a-4501-afad-756dd34cde3c]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=94ddcb56-a00d-4085-a522-4ade1a6c439c]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=dd19786b-6e93-4234-ad04-da2d994bf7c9]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e03d4f9c-f63a-42d7-8625-4bf4dddca852]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d802cc97-e3e4-4e71-869b-096a03628c39]
module.keycloak_prod.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=652cb0a5-514b-4ed4-9455-7b4fe53d695c]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7365adae-5541-4c71-a2e2-db5f6a136c92]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fd5e656-ccf1-41de-9452-b81b3f9f3fd1]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5cfbb915-ad07-4d05-9c51-a4d1ac7380bd]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=efae425f-33d2-4ffe-8a45-d92a3735d27a]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7fc4689-c53c-46c4-a5ce-f3a8cacb44fa]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8afc996b-849d-4bbf-a0a3-3f6459a92d13]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f14e273-5f8e-446b-9350-093b3f75a875]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4faad465-1e05-487f-9e2c-d09c78e37c95]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b978cd4-a115-4c44-a1db-3c0c46bbef34]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8cc4d661-9d61-49a5-905e-9cba65a85cde]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bdc7949f-5895-4516-b440-b5c8649aee3a]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=61182e46-69f7-48e4-9123-a416cd756b42]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a995c8fd-ca58-4f09-a94a-2a41bf54ca79]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6e4b0315-ee6d-4107-8a32-afe7afea0c42]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=47a0de2d-6af5-404e-bafe-45581c0fa4fa]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=520d73ff-bb76-4f59-b305-5d56736e39b1]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7a76ea10-1efd-496f-b12c-0389e2b28055]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1e725f9-45a8-439b-95ba-f248757e8911]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2c92295f-b617-4a8b-abce-d78f46906de4]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d7cc3f91-a3f8-4c10-b7ff-53f5cb5dcc9f]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e77da751-8434-416c-88ca-875a02fe3666]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=14f0d0bc-2ddb-46a0-bf05-a4212c669e90]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=01dcb62a-ec3f-42d6-be9c-6fb5173640b3]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=31c53f1d-1fb0-4b06-b48f-0c9c9c4aaf16]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c4b405e-48c4-424e-ad46-c05ddf8187c6]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=34fe8125-8207-4620-b672-6349c58fce3f]
module.keycloak_prod.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=de4ef932-f1d1-402b-bfad-133cd8b7f89a]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6203e288-85f6-47cf-a572-f3b7b25d6ba1]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dca11070-2b8f-4a24-95f7-5de4506224f3]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=accb4620-9139-4614-adcf-c6cee0a5cee6]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b17d0706-85d8-48a7-9fb9-1a40e2859a04]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5cb317ec-4938-488e-a976-a2b17310abb7]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7f29356e-1f2a-4801-bf79-997ea6f6771d]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=92eb1cbb-06ee-4202-b84d-271911fd135f]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3e224f08-e8e7-4e5d-9838-8b71ce1d1929]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1f86c27b-58ea-4672-a0b8-f831e533cee7]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8cbdee98-c6ba-49e5-b92f-0c3cc9f305ed]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5f82c756-9443-48a7-9501-cb6eb0eb2ac3]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dc0e2750-aad7-4a56-af72-ec14d64b9835]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=14261463-072b-4a54-8f8a-9b4b987e00c8]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=20729323-b67e-4658-9978-dbf7f970220c]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3f301a5d-2bfd-47cf-95b2-1221166820af]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0fe9e1ce-b106-4b12-ba6c-284f60baf198]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=79c4664d-82a0-4406-8b67-80a9d42b3b89]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa0006ac-75d9-4ef4-99b2-b0433c147c72]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3d3295b-775a-491d-88c6-5c8ddf171244]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccebffe8-4187-478b-92ae-2632a8966fb9]
module.keycloak_prod.module.onestopauth.module.client_asdfaaaaaaaaaaaaaaaaaaaaaaaaa-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6a806dfc-9d85-43a3-ab8d-65509f7037d2]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4f93306f-813d-4a9e-8c61-eb0faa67f5b1]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b60f5d60-2a11-4cb9-b925-f6f099ad9175]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b61a18dd-8186-4ba7-841c-d82548284556]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=dfa84fd2-243a-43d6-921c-1e0adcbb615c]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=50578257-75bc-4965-9e24-146296065069]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f43f2e95-e301-498f-85ca-de90ca107cfe]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d5498eaa-0dce-45b5-b63e-91ddb252aed9]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=270baf74-dd24-4b11-b214-7f4c04fe8ef8]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f27edc20-805f-45ad-9b51-993467d5d6e8]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=585de5c4-65d5-424b-9a9e-585809ee98e6]
module.keycloak_prod.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9d04bdd-d48e-4960-a19c-5a7ead89a1e9]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6ad7d02f-7231-4adf-b17f-963ad709dc79]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=32bcda19-7cb0-411b-9a0f-426148d3d652]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=16239147-11e0-4a08-bb5b-578b9cb7bfee]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=27de8248-9343-4f14-a05e-ea8ed9fdba20]
module.keycloak_prod.module.onestopauth.module.client_automergetestjun-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b54f61db-d6e4-484f-9e3d-6be3d59fca0f]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b44cd2f-d198-4809-9b78-549ad057b924]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=415a4e26-9b3f-4b3f-b6b8-68b60c301ce0]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c182d801-b9a7-4bc6-8e62-25d630dd46bd]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a505970-a611-4d05-af78-26ed0f0c0082]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c54fccea-5aaf-4fcd-a102-cdcb42edbd10]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=86686d11-07cc-4798-8d98-25223832e91b]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e75d623-22ed-4b1d-8396-cc5f0760b923]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a249f5c8-339a-4e79-891a-9cabff5710a6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "testing-4-4523"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testing-4-4523"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_testing-4-4523.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "testing-4-4523"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testing-4-4523"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:8080",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "testing-4-4523"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testing-4-4523"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_testing-4-4523.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "testing-4-4523"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testing-4-4523"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:8080",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3321 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*